In [31]:
import numpy as np
import pandas as pd

In [44]:
feature=pd.read_csv('/content/sample_data/features.csv')
store=pd.read_csv('/content/sample_data/stores.csv')
weeksales=pd.read_csv('/content/sample_data/Walmart_Store_sales.csv')
train=pd.read_csv('/content/sample_data/train.csv')

In [33]:
feature.head()

   Store        Date  Temperature  ...         CPI  Unemployment  IsHoliday
0      1  2010-02-05        42.31  ...  211.096358         8.106      False
1      1  2010-02-12        38.51  ...  211.242170         8.106       True
2      1  2010-02-19        39.93  ...  211.289143         8.106      False
3      1  2010-02-26        46.63  ...  211.319643         8.106      False
4      1  2010-03-05        46.50  ...  211.350143         8.106      False

[5 rows x 12 columns]

In [34]:
feature.shape

(8190, 12)

In [35]:
feature.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8190 entries, 0 to 8189
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Store         8190 non-null   int64
 1   Date          8190 non-null   object
 2   Temperature   8190 non-null   float64
 3   Fuel_Price    8190 non-null   float64
 4   MarkDown1     4032 non-null   float64
 5   MarkDown2     2921 non-null   float64
 6   MarkDown3     3613 non-null   float64
 7   MarkDown4     3464 non-null   float64
 8   MarkDown5     4050 non-null   float64
 9   CPI           7605 non-null   float64
 10  Unemployment  7605 non-null   float64
 11  IsHoliday     8190 non-null   bool
dtypes: bool(1), float64(9), int64(1), object(1)
memory usage: 712.0+ KB

In [36]:
feature.describe()

             Store  Temperature  ...          CPI  Unemployment
count  8190.000000  8190.000000  ...  7605.000000   7605.000000
mean     23.000000    59.356198  ...   172.460809      7.826821
std      12.987966    18.678607  ...    39.738346      1.877259
min       1.000000    -7.290000  ...   126.064000      3.684000
25%      12.000000    45.902500  ...   132.364839      6.634000
50%      23.000000    60.710000  ...   182.764003      7.806000
75%      34.000000    73.880000  ...   213.932412      8.567000
max      45.000000   101.950000  ...   228.976456     14.313000

[8 rows x 10 columns]

In [37]:
store.head()

   Store Type    Size
0      1    A  151315
1      2    A  202307
2      3    B   37392
3      4    A  205863
4      5    B   34875

In [38]:
store.shape

(45, 3)

In [39]:
store.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45 entries, 0 to 44
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Store   45 non-null     int64
 1   Type    45 non-null     object
 2   Size    45 non-null     int64
dtypes: int64(2), object(1)
memory usage: 1.2+ KB

In [23]:
store.describe()

           Store           Size
count  45.000000      45.000000
mean   23.000000  130287.600000
std    13.133926   63825.271991
min     1.000000   34875.000000
25%    12.000000   70713.000000
50%    23.000000  126512.000000
75%    34.000000  202307.000000
max    45.000000  219622.000000

In [40]:
weeksales.head()

   Store        Date  Weekly_Sales  ...  Fuel_Price         CPI  Unemployment
0      1  05-02-2010    1643690.90  ...       2.572  211.096358         8.106
1      1  12-02-2010    1641957.44  ...       2.548  211.242170         8.106
2      1  19-02-2010    1611968.17  ...       2.514  211.289143         8.106
3      1  26-02-2010    1409727.59  ...       2.561  211.319643         8.106
4      1  05-03-2010    1554806.68  ...       2.625  211.350143         8.106

[5 rows x 8 columns]

In [41]:
weeksales.shape

(6435, 8)

In [28]:
weeksales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6435 entries, 0 to 6434
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Store         6435 non-null   int64
 1   Date          6435 non-null   object
 2   Weekly_Sales  6435 non-null   float64
 3   Holiday_Flag  6435 non-null   int64
 4   Temperature   6435 non-null   float64
 5   Fuel_Price    6435 non-null   float64
 6   CPI           6435 non-null   float64
 7   Unemployment  6435 non-null   float64
dtypes: float64(5), int64(2), object(1)
memory usage: 402.3+ KB

In [29]:
weeksales.describe()

             Store  Weekly_Sales  ...          CPI  Unemployment
count  6435.000000  6.435000e+03  ...  6435.000000   6435.000000
mean     23.000000  1.046965e+06  ...   171.578394      7.999151
std      12.988182  5.643666e+05  ...    39.356712      1.875885
min       1.000000  2.099862e+05  ...   126.064000      3.879000
25%      12.000000  5.533501e+05  ...   131.735000      6.891000
50%      23.000000  9.607460e+05  ...   182.616521      7.874000
75%      34.000000  1.420159e+06  ...   212.743293      8.622000
max      45.000000  3.818686e+06  ...   227.232807     14.313000

[8 rows x 7 columns]

In [45]:
train.head()

   Store  Dept        Date  Weekly_Sales  IsHoliday
0      1     1  2010-02-05      24924.50      False
1      1     1  2010-02-12      46039.49       True
2      1     1  2010-02-19      41595.55      False
3      1     1  2010-02-26      19403.54      False
4      1     1  2010-03-05      21827.90      False

In [46]:
train.shape

(421570, 5)

In [47]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 421570 entries, 0 to 421569
Data columns (total 5 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Store         421570 non-null  int64
 1   Dept          421570 non-null  int64
 2   Date          421570 non-null  object
 3   Weekly_Sales  421570 non-null  float64
 4   IsHoliday     421570 non-null  bool
dtypes: bool(1), float64(1), int64(2), object(1)
memory usage: 13.3+ MB

In [48]:
train.describe()

               Store           Dept   Weekly_Sales
count  421570.000000  421570.000000  421570.000000
mean       22.200546      44.260317   15981.258123
std        12.785297      30.492054   22711.183519
min         1.000000       1.000000   -4988.940000
25%        11.000000      18.000000    2079.650000
50%        22.000000      37.000000    7612.030000
75%        33.000000      74.000000   20205.852500
max        45.000000      99.000000  693099.360000